[
  {
    "locale": "español",
    "texto": "Estás a punto de comenzar a aprender Gupapuyŋu — un idioma de la familia lingüística Yolŋu Matha, hablado por los pueblos de las primeras naciones del nordeste de Arnhem Land. No se trata solo de otro ejercicio lingüístico. Es una invitación para entrar en un mundo vivo, moldeado por una de las culturas más antiguas y continuas del planeta.<br/><br/>Esta plataforma existe para abrir el acceso — a estudiantes, a amantes de los idiomas, y a quienes reconozcan el inmenso valor de los sistemas indígenas de conocimiento. Ha sido creado a partir de materiales desarrollados en colaboración con ancianos y maestros Yolŋu, con profundo respeto por su guía, autoridad y vínculo inquebrantable con la tierra.<br/><br/>Cada palabra que aprendes está cargada de significados tejidos con ley ancestral, parentesco y ceremonia. No son conceptos abstractos. Son realidades vividas, encarnadas — sostenidas durante decenas de miles de años. Idiomas como el Gupapuyŋu han resistido colonización, desplazamiento y borrado. Que hoy puedas aprenderlo es fruto tanto de una resistencia feroz como de una enseñanza generosa.<br/><br>Aborda este aprendizaje con seriedad y humildad. Habla con precisión. Escucha con profundidad. Lo que aprendes te vinculará — no en sentido metafórico, sino directo — con comunidades cuyas tradiciones orales se remontan a más de 50.000 años.<br/><br/>Y no permitas que se detenga en ti. Compártelo. Hónralo. Deja que tu aprendizaje contribuya a que estas lenguas sigan vivas — no solo en libros o páginas web, sino en bocas, en cantos, en futuros."
  },
  {
    "locale": "english",
    "texto": "You're about to begin learning Gupapuyŋu — a language from the Yolŋu Matha family, spoken by First Nations people of north-east Arnhem Land. This is not just a linguistic exercise. It's an invitation to step into a living world, shaped by one of the longest continuous cultures on Earth.<br/><br/>This platform exists to make access possible — for learners, for lovers of languages, for those who recognise the profound value of Indigenous knowledge systems. It’s built on resources that were developed in collaboration with Yolŋu elders and educators, with deep respect for their guidance, authority and connection to Country.<br/><br/>Every word you learn carries meaning layered with ancestral law, kinship, land, and ceremony. These are not abstract terms. They are lived, embodied realities — sustained over tens of thousands of years. Languages like Gupapuyŋu have endured colonisation, dislocation and erasure. The fact that you can learn it now is a result of both fierce resistance and generous teaching.<br/><br/>Approach this study with seriousness and humility. Speak carefully. Listen deeply. What you learn connects you — not metaphorically, but directly — to communities whose oral traditions stretch back over 50,000 years.<br/><br/>And don’t let it stop with you. Share it. Honour it. Let your learning be part of ensuring these languages continue to live — not just in books or websites, but in mouths, in songs, in futures."
  },
  {
    "locale": "عربي",
    "texto": "إنت هتبدأ تتعلّم لغة اسمها جُبابونجو — لغة من عائلة يولنغو ماتا، وبيتكلّموها ناس من أوائل الشعوب في شمال شرق أرنهم لاند. ده مش مجرّد تمرين لغوي. ده دعوة إنك تدخل عالم حيّ، عايش وبيتنفّس، ومشكّله واحدة من أقدم وأكتر الثقافات اللي لسه مستمرّة على الكرة الأرضية.<br/><br/>البلاتفورمة دي موجودة عشان تفتح الباب — للطلاب، وللي بيحبّوا اللغات، وللي فاهمين قد إيه فيه قيمة كبيرة في نظم المعرفة الأصليّة. البلاتفورمة دي مبنيّة على موادّ اتطوّرت بتعاون مع شيوخ ومعلّين من يولنغو وباحترام عميق لهدايتهم وسلطتهم وارتباطهم القويّ بالأرض اللي فيها جذورهم.<br/><br/>كل كلمة إنت بتتعلّمها فيها معاني مربوطة بقوانين أجداد، ونسب، وأرض، ومراسم. الحاجات دي مش كلمات مجرّدة. دي حقايق معيشة، محسوسة، ومستمرّة بقالها عشرات الآلاف من السنين. لغات زي جُبابونجو عدّوا على استعمار، وتشريد، ومحو. وإنك تقدر تتعلّمها دلوقتي، ده نتيجة مقاومة شرسة، وتعليم كريم.<br/><br/>خد التعلّم ده بجدّيّة وتواضع. اتكلّم بدقّة. اسمع بعمق. اللي هتتعلّمه هيّوصّلك — مش مجازي، لأ، دوغري — لمجتمعات تقاليدهم الشفهيّة راجعة لأكتر من ٥٠،٠٠٠ سنة.<br/><br/>وما تخلّيش التعلّم يوقف عندك. انشره. احترمه. خلّي التعلّم بتاعك يبقى جزء من إن التراث اللغويّ ده يفضل عايش — مش بس في كتب ولا مواقع، لا، في البقول، في الأغاني، في المستقبلات."
  },
  {
    "locale": "עברית",
    "texto": "אתה עומד להתחיל ללמד את גוּפָּפּוּיְנְגוּ — שפה ממשפחת השפות יוֹלוּנְגוּ מַתָּ'ה, שנאמרת על-ידי עמי האמות הראשונות בצפון-מזרח ארץ אַרְנְהֶם."
  },
  {
    "locale": "فارسی",
    "texto": ""
  },
  {
    "locale": "יידיש",
    "texto": ""
  },
  {
    "locale": "português",
    "texto": "Você está prestes a começar a aprender Gupapuyŋu — um idioma da família linguística Yolŋu Matha, falado pelos povos originários do nordeste de Arnhem Land. Isso não é apenas mais um exercício linguístico. É um convite para entrar num mundo vivo, moldado por uma das culturas mais antigas e contínuas do planeta.<br/><br/>Esta plataforma existe para abrir acesso — a estudantes, amantes de línguas e a quem reconhece o imenso valor dos sistemas indígenas de conhecimento. Foi criada a partir de materiais desenvolvidos em colaboração com anciãos e mestres Yolŋu, com profundo respeito por sua orientação, autoridade e conexão inquebrantável com a terra.<br/><br/>Cada palavra que você aprende carrega significados tecidos com lei ancestral, parentesco, território e cerimônia. Não são conceitos abstratos. São realidades vividas, encarnadas — sustentadas por dezenas de milhares de anos. Idiomas como o Gupapuyŋu resistiram à colonização, ao deslocamento e ao apagamento. O fato de você poder aprender isso hoje é fruto tanto de uma resistência feroz quanto de um ensinamento generoso.<br/><br/>Leve esse aprendizado com seriedade e humildade. Fale com precisão. Escute com profundidade. O que você aprende vai te ligar — não metaforicamente, mas de forma direta — às comunidades cujas tradições orais remontam a mais de 50.000 anos.<br/><br/>E não deixe que pare em você. Compartilhe. Honre isso. Deixe que seu aprendizado contribua para manter essas línguas vivas — não apenas em livros ou sites, mas nas bocas, nos cantos, nos futuros."
  },
  {
    "locale": "français",
    "texto": ""
  },
  {
    "locale": "türkiye",
    "texto": "Gupapuyŋu dilini öğrenmeye başlamak üzeresin. Yolŋu Matha dil ailesine ait Arnhem Land’in kuzeydoğusunda yaşayan yerli halklar tarafından konuşulan bir dildir. Bu, dünyanın en eski ve kesintisiz kültürlerinden biri tarafından şekillendirilmiş canlı bir dünyaya adım atman için bir davettir."
  },
  {
    "locale": "日本語",
    "texto": "あなたはこれからグパプユン語を学び始めます。ヨルング・マサ語族の言語であり、アーネム・ランドの北東部に住むファースト・ネーションズの人々によって話されています。 "
  },
  {
    "locale": "magyar",
    "texto": "Éppen most készülsz megtanulni a Gupapuyŋu nyelvet — A Yolŋu Matha nyelvcsaládhoz tartozó nyelv. Az Arnhem-föld északkeleti részén élő első nemzetek népei által beszélt. Ez nem csupán egy nyelvi gyakorlat. Ez egy meghívás arra, hogy belépj egy élő világba, amelyet a Föld egyik legrégebbi, folyamatosan fennálló kultúrája formált."
  },
  {
    "locale": "українська",
    "texto": "Ти от-от почнеш вивчати Ґупапуюнґу— мову з мовної родини Йолнґу Мата, якою розмовляють народи перших націй на північному сході Землі Арнем. Це не просто ще одна мовна вправа. Це запрошення увійти в живий світ сформований однією з найдавніших і безперервних культур планети. "
  },
  {
    "locale": "gàidhlig (albannach)",
    "texto": ""
  }
]
