[
  {
    "locale": "español",
    "texto": ""
  },
  {
    "locale": "english",
    "texto": "There are two verbs that behave a bit differently:<br/>djälthirri → to want<br/>marŋgithirri → to know<br/><br/>Both also have corresponding adjective forms: djäl and marŋgi, which literally mean 'in want of' and 'in need of'. And when we use them this way, the noun that follows (the thing desired or known) gets marked — with one of the suffixes: gu / ku / wu / wa, depending on its ending.<br/><br/><span style='font-size: 17px; color: #ffff00'>1. If the noun ends in a vowel or vowel and glottal stop (a, i, u or a’, i’, u’) you add –wa/-wu to the end:</span><br/>Ŋarra djäl gupawa → I want water<br/>Nhe djäl ŋathawa → You want food<br/>Ŋarra marŋgi Djäwawa → I know Djäwa<br/><br/><span style='font-size: 17px; color: #ffff00'>2. If the noun ends in a stop consonant (p, t, ṯ, tj, k, ’) you add –ku:</span><br/>Ŋarra djäl miyalkku → I want a woman<br/>Ŋayi djäl yarramanku → He wants a horse<br/>Ŋarra marŋgi Mawalan'ku → I know Mawalan'<br/><br/><span style='font-size: 17px; color: #ffff00'>3. If the noun ends in a nasal, liquid or glide (m, n, ṉ, ny, ŋ, l, ḻ, r, rr, y, w) you add –gu:</span><br/>Ŋarra djäl mundhurrgu → I want a gift<br/>Ŋayi djäl waŋganygu → He wants one<br/>Ŋarra marŋgi Stephengu → I know Stephen<br/><br/>And for personal pronouns, we apply the possession suffixes from Lesson 3:<br/>Ŋarra djäl nhuŋu → I want you<br/>Ŋarra djäl ŋarraku → I want myself<br/>Ŋarra djäl nhanŋu → I want her/him<br/>Ŋarra djäl ŋalitjalaŋgu → I want us (you + me)<br/>Ŋarra djäl ŋalinyalaŋgu → I want us (her/him + me)<br/>Ŋarra djäl walalaŋgu → I want them<br/><br/>So far so good. But what if you want to do something? What if you want to say:<br/>I want to write<br/>We know how to dance<br/>I want to see Djäwa<br/><br/>Now we need the infinitive. Like what we learned in Lesson 14, we take the quaternary form of the verb and add -wa. This second verb — the verb that follows “want” or “know” — takes the suffix. The first verb stays in whatever tense you're expressing: past, present, or future.<br/><br/>Ŋarra djäl wukirriwa → I want to write<br/>Ŋali marŋgi giritjinyarawa → We know how to dance<br/>Nhe djäl marrtjinyarawa → You want to go<br/>Ŋarra marŋgi djämawa → I know how to work<br/><br/>And just like before, if a noun accompanies the infinitive — if there’s something being eaten, seen, heard, counted — that noun also gets a suffix to show its role in the sentence:<br/>Ŋarra djäl gapuwa ḻukanharawa → I want to drink water<br/>Nhe djäl Djäwawu nhänharawa → You want to see Djäwa<br/>Ŋayi djäl manikaygu ŋänharawa → He wants to hear the song<br/>Ŋali marŋgi ŋathawa bathanarawa → We know how to cook food<br/>Walala marŋgi bathiwa ḏar’ṯaryunarawa → They know how to make a basket<br/><br/>Sometimes, we can drop djäl or marŋgi entirely, and just use the infinitive form — that quaternary verb + -wa — to express purpose. This is similar to saying “in order to” in English. Compare:<br/>Ŋayi marrtjina bothurru → He went to count<br/>Ŋayi marrtjina bothurruwa → He went in order to count<br/><br/>That little -wa carries a lot of weight. It tells us why the action happened. Another example:<br/>Ŋali marrtjina nhänharawa → We went to see<br/>Ŋali marrtjina ŋayathanharawa → We went to keep it<br/><br/>And again, if there’s a noun involved, it too needs to show its purpose:<br/>Ŋali marrtjina gapuwa ḻukanharawa → He went in order to drink water<br/>Ŋali marrtjina miyalkku djaw’yunarawa → He went to run away from the woman<br/><br/>You can even drop the verb completely and let the noun carry the meaning:<br/>Ŋarra marrtjina ŋathawa manymakku → I went for good food<br/>Yothu ga ŋäthi ŋäminiwa → The baby is crying for milk<br/>Dhuwala djurra’ nhänharawa → This book is for looking at<br/>Dhuwala yiki mitthunarawa → This knife is for cutting<br/><br/>Sometimes, some ambiguity might occur. Take this sentence: Ŋarra nhuŋu djäl guŋga’yunarawa. It could mean I want to help you, or I want you to help. So how do we clarify? You can restructure the sentence like this:<br/>Ŋarra djäl ŋarra dhu nhuna guŋga’yun → I want (that) I will help you<br/>Ŋarra nhuŋu djäl nhe yurru guŋga’yun → I want you (that) you will help<br/><br/>Also, if the noun already carries a suffix like -lili or -gala, you don’t stack -wa on top of that. You leave it as is:<br/>Ŋarra djäl wäŋalili marrtjinyarawa → I want to go to the camp<br/><br/>You can shift the meaning by placing the noun with dhuwala/dhuwali without a suffix and the verb with -wa in its quaternary after:<br/>Dhuwala djurra’ nhänharawa → This book is for looking at<br/>Dhuwala yiki mitthunarawa → This knife is for cutting<br/>Because here, the noun is the subject, not the object, the verb describes what the thing is for, not what you do with it.<br/><br/>Finally, a quick zoom out.<br/>At this point, you might be wondering: hang on, isn’t this literally identical to what we learned in Lesson 14 — the infinitive, that quaternary form + -wa? So how do we tell them apart?<br/><br/>Well, the key insight: we don’t really need to.<br/><br/>Because the infinitive and the expression of purpose are deeply entangled — in fact, in many cases, they’re the same thing. Think about the sentence: He went to write.<br/><br/>“To write” is the infinitive. But it also answers why he went. It tells us the purpose of the going. So it makes sense — and isn’t a coincidence — that the form for the infinitive and the form for expressing purpose both use the same verb structure and the same suffix.<br/><br/>But this connection goes even deeper. Remember Lesson 5? When we first saw gu/ku/wu/wa as suffixes of possession?<br/><br/>Well, possession isn’t just about owning something. It’s also about accountability, origin, and sometimes even intent. In this language, who something belongs to can also mean why that thing exists at all.<br/><br/>Take this sentence:<br/>Dhuwala guya Djäwawa → This is Djäwa’s fish.<br/><br/>Yes, it’s a possession statement. But you could just as easily feel it as: This fish exists because of Djäwa.<br/><br/>Djäwa is the reason it’s here. Their actions or rights or story brought it into relevance. In that way, the possessor charges the noun with purpose. It holds relational weight.<br/><br/>So while it might feel strange at first that these suffixes — gu, ku, wu, wa — show up across so many seemingly unrelated grammatical areas, there’s a deeper pattern:<br/>They’re about purpose.<br/>They bind things to a cause, to a why.<br/>They give meaning to direction, action, possession, and intent — often at the same time.<br/><br/>They don't just mark the role of a noun or a verb in a sentence.<br/>They mark why that word matters at all."
  },
  {
    "locale": "عربي",
    "texto": ""
  },
  {
    "locale": "עברית",
    "texto": ""
  },
  {
    "locale": "فارسی",
    "texto": ""
  },
  {
    "locale": "יידיש",
    "texto": ""
  },
  {
    "locale": "português",
    "texto": ""
  },
  {
    "locale": "français",
    "texto": ""
  },
  {
    "locale": "türkiye",
    "texto": ""
  },
  {
    "locale": "日本語",
    "texto": ""
  },
  {
    "locale": "magyar",
    "texto": ""
  },
  {
    "locale": "українська",
    "texto": ""
  },
  {
    "locale": "gàidhlig (albannach)",
    "texto": ""
  }
]
