[
  {
    "locale": "español",
    "texto": ""
  },
  {
    "locale": "english",
    "texto": "Now let’s talk about another key form in the present tense: the imperative — commands.<br/><br/>When you want something to happen — when you need someone to do something — you use the imperative.<br/><br/>Same in English: Work! Watch! Eat! Be quiet!<br/><br/>In Gupapuyŋu, the imperative is expressed using the secondary form of the verb — on its own.That’s crucial: the secondary form only becomes a command when it stands alone. Think about English. If you say: You work → it's just a description. But if you say: Work! → now you're giving an order. Gupapuyŋu works the same way. And remember, the secondary form is also used to express the negative of the continuous present, like what we just learned in Lesson 6.<br/><br/>Djäma! → Work!<br/>Wukirri! → Write!<br/>Marrtji! → Go!<br/>Ḻuki! → Eat!<br/>Waŋi! → Talk!<br/>Ŋorri! → Sleep! / Lie down!<br/>Mukthurru! → Be quiet!<br/><br/>Notice something?<br/>Often in English, we’d say: “Give it!”, “Say it!”, “Take it!”. But in Gupapuyŋu, you don’t need that “it”. The meaning is already implied — it’s built into the context, the world, the moment. Gurrupulu! → Give! There’s no “it” — and you don’t need it.<br/><br/>The action is understood because Gupapuyŋu assumes you’re tuned into the same moment as the speaker. There's linguistic efficiency rooted in shared presence.<br/><br/>We can also make these commands negative, simply by adding the work “yaka”.<br/><br/>Yaka djäma! → Don’t work!<br/>Yaka ŋäthi! → Don’t cry!<br/>Yaka waṉḏi! → Don’t run!<br/><br/>One more observation...In English, Gupapuyŋu, and Japanese, the imperative is not sensitive to gender or number. You say the same thing whether you're addressing one person or a crowd:<br/>Go!<br/>Marrtji!<br/>行きます!<br/>But in other languages — Spanish, French, Arabic, Yiddish, Hebrew, Portuguese — the command changes depending on who you’re talking to. It bends for number. It shifts for gender.<br/><br/>In Gupapuyŋu, all the energy stays focused on the action itself — not the identity of who’s being addressed.<br/><br/>Oh, and one more bit of food for thought in this lesson…Did you notice the word “marrtji”? It means “go”. Now read it out loud:<br/>Marrtji.<br/>Doesn’t it sound strangely familiar? Like “march” in English. Or “marchar” in Spanish — to march, to go, to move forward.<br/><br/>All three carry the same root meaning: motion, progression, departure.<br/><br/>But these languages — Yolŋu Matha, English, Spanish — come from entirely different worlds. There’s no historical connection between Gupapuyŋu and the Indo-European language family.<br/><br/>So… what’s going on?<br/>Coincidence? Maybe. But not a useless one.<br/>Linguists call these sound-symbolic convergences or sometimes just false cognates — words that happen to sound similar and mean something similar, but without any shared origin.<br/>But maybe there’s more to it than coincidence.<br/>When a concept is universally urgent — like motion — languages tend to lean toward short, punchy, muscular sounds to express it.<br/><br/>Going. Leaving. Moving. Commanding someone to go. These aren’t abstract ideas — they’re immediate, physical, tied to survival. The body moves before the mind finishes the sentence.<br/>“Marrtji.”<br/>“March.”<br/>“Marchar.”<br/>They all have that sharp rhythm, that forward-pushing energy. Maybe sound just finds its way into shape when it needs to move.<br/><br/>And in cultures like the Yolŋu, where movement is not just physical but ceremonial, territorial, ancestral — the word for “go” isn’t casual. It carries weight. When someone says marrtji, they’re not just telling you to walk — they might be setting something in motion much older than the moment.<br/><br/>So, maybe it's just coincidence.<br/>Or maybe it’s rhythm, culture, and urgency aligning across thousands of years.<br/>Either way — marrtji is a word that moves."
  },
  {
    "locale": "عربي",
    "texto": ""
  },
  {
    "locale": "עברית",
    "texto": ""
  },
  {
    "locale": "فارسی",
    "texto": ""
  },
  {
    "locale": "יידיש",
    "texto": ""
  },
  {
    "locale": "português",
    "texto": ""
  },
  {
    "locale": "français",
    "texto": ""
  },
  {
    "locale": "türkiye",
    "texto": ""
  },
  {
    "locale": "日本語",
    "texto": ""
  },
  {
    "locale": "magyar",
    "texto": ""
  },
  {
    "locale": "українська",
    "texto": ""
  },
  {
    "locale": "gàidhlig (albannach)",
    "texto": ""
  }
]
