[
  {
    "locale": "español",
    "texto": ""
  },
  {
    "locale": "english",
    "texto": "You might have been thinking throughout the previous lessons:<br/>Why is word order free in Gupapuyŋu?<br/>Why can I just totally change up the order of almost every word in a sentence and it still makes sense?<br/>How could complex ideas and chains of events ever be communicated clearly?<br/>Does everyone just guess what’s happening?<br/><br/>Well, this is where it starts to click.<br/><br/>We’re about to get into the meat of the suffixes.<br/><br/>Let’s start with a foundational one: A suffix that shows who the verb is being done to.<br/><br/>This is what’s known as the direct object of the verb— the person (or thing) that receives the action.<br/>“I saw Yindi” → Yindi is being seen → direct object<br/>“He hit Jedda” → Jedda is the one being hit → direct object<br/><br/>And in Gupapuyŋu whenever the direct object is a human, we add the suffix –nha to the end of the word.<br/><br/>This might feel new if you’re used to English, but if you’ve studied:<br/>- Ukrainian: you’ll know the word ending changes depending on whether it’s the object.<br/>- Turkish: you add a suffix to mark the direct object, like –ı, –i, –u or –ü.<br/>- Hungarian: uses –t or variations depending on vowel harmony and consonant flow.<br/>- Japanese: uses the particle を to mark direct objects.<br/><br/>In short: this is not strange. Gupapuyŋu fits beautifully into a global family of object-marking languages. What’s special is how it does it, with –nha, for humans only.<br/>Gäthura ŋarra nhäŋala Djäwanha → Today I saw Djäwa<br/>Djäwa is being seen, so we add –nha.<br/><br/>Now compare:<br/>Napurru lipalipa nhäŋala → We saw a canoe<br/>Here, lipalipa (canoe) is a direct object, but it’s not human, so it stays unchanged. The logic is sharp and human-centred, people carry markers. Things don’t.<br/><br/>Personal pronouns change too when they’re objects:<br/><br/><span style='font-size: 17px; color: #ffff00'>Singular, One person:</span><br/>Ŋarranha → me<br/>Nhuna → you<br/>Ŋanya → him / her<br/><br/><span style='font-size: 17px; color: #ffff00'>Dual, Two people:</span><br/>Ŋalitjalanha → us (you and I)<br/>Ŋalinyalanha → us (he/she and I)<br/>Nhumalanha → you two<br/>Maṉḏanha → them two<br/><br/><span style='font-size: 17px; color: #ffff00'>Plural, Three or more:</span><br/>Ŋalimurrunha → us (you and I)<br/>Ŋanapurrunha → us (them and I)<br/>Nhumalanha → you all<br/>Walalanha → them<br/><br/>Note: you might also see sometimes that the ŋa at the start of the personal pronoun gets changed to ŋi or it gets eliminated completely, for example Ŋalimurrunha can appear as Ŋilimurrunha or just Limurrunha, it's all the same, just regional sound preferences.<br/><br/>Ok, so we've done the object. What about the subject?<br/><br/>In Gupapuyŋu, if the subject is a personal pronoun (like ŋarra, nhe, ŋayi), you leave it unchanged.<br/>Gäthura ŋarra nhäŋala Djäwanha → I saw Djäwa today<br/>ŋarra = “I” is a personal pronoun → no suffix needed.<br/><br/>But if the subject is a name or noun, you need a subject suffix. This tells the listener clearly who is doing the action, no matter where the word sits in the sentence.<br/><br/>Just like in:<br/>- Japanese: uses が (ga) to mark the subject.<br/>- MSA uses ḍamma (ـُ)<br/><br/>In Gupapuyŋu, subject suffixes are added only when the subject is not a pronoun, it can be either human or non human. And the suffix changes depending on the final sound of the noun (Because this is an oral-first language and sound really matters).<br/><br/><span style='font-size: 17px; color: #ffff00'>1. Noun ends in a vowel or glottal vowel (a, i, u or a’, i’, u’) → add –y</span><br/>Djäway ŋarranha bumara → Djäwa hit me<br/>Lorruy nhuna bumara → Lorru hit you<br/><br/><span style='font-size: 17px; color: #ffff00'>2. Noun ends in a liquid consonant  or liquid and glotal stop (l, ḻ, r, rr, y, w, l', ḻ', r', rr', y', w') → add –yu</span><br/>Mawulyulyu ŋarranha bumara -> Mawulyul hit me<br/>Marmburryu nhuna bumara -> Marmburr hit you<br/><br/><span style='font-size: 17px; color: #ffff00'>3. Noun ends in a nasal (m, n, ṉ, ny, ŋ) → add –dhu</span><br/>- Stephendhu ŋarranha bumara → Stephen hit me<br/>- Djirinydhu nhuna bumara → Djiriny hit you (Note, this ends in ny remember, not just y)<br/><br/><span style='font-size: 17px; color: #ffff00'>4. Noun ends in a stop consonant or nasal + glottal (p, t, ṯ, tj, k, m’, n’, ny’, ṉ’, ŋ’) → add –thu</span><br/>- Wandjukthu ŋarranha bumara → Wandjuk hit me<br/>- Miyalkthu nhuna bumara → The woman hit you<br/><br/>Also, this subject suffix system only applies when the verb is transitive, i.e., it has a direct object.<br/>Stephendhu moŋala → Stephen forgot (something)<br/>Miyalkthu dhuḻ’yurruna → The woman built (something)<br/>Djäway ḻukana → Djäwa ate (something)<br/><br/>But if the verb is intransitive, no suffix is needed. Not all actions are done to someone or something. Sometimes, the action just happens. You go. You sleep. You run. There’s no “it/something” being acted upon. No one receiving the verb.<br/><br/>Stephen marrtjina → Stephen went<br/>Miyalk waŋana → The woman spoke<br/>Djäwa ḏar’ṯaryurruna → Djäwa sang<br/><br/>You can’t say “Stephen went it.” That doesn't really make sense. The action is complete with just the subject.<br/><br/>But.... you need to tune in a little. Some verbs that look transitive in English… aren’t in Gupapuyŋu. For example:<br/>Miyalk waŋana → The woman spoke/talked<br/><br/>Now in English, you could say “She spoke English”. So you might think there’s an object. But in Gupapuyŋu, waŋa (to talk/to speak) is only intransitive. So, it helps to think of it as just “to talk”.<br/><br/>This is why it counts not to force direct translations, because actually they don't exist! Most words that are intransitive in English are also intransitive in Gupapuyŋu, and same with transitive, but there are exceptions. Check the dictionary <a style='cursor: url('https://thedial.infura-ipfs.io/ipfs/QmbR22PYokrESYeCtwrwpETsby8q959zVNJgSv1x136yiQ'), auto;' href='https://dhawu.emancipa.xyz/wukirri/djama/'>here</a> if you need to check a word.<br/><br/>This suffix is also used to denote by/with what the action takes place, again, using the same familiar rules of sound that we’ve already been practicing.<br/><br/>In other words, if you want to say how something was done, or with what it was done, you use this same system of suffixes. Think about these English phrases:<br/>I hit him with a stick<br/>I wrote the letter with a pen<br/>I went by boat<br/>I travelled on foot<br/><br/>In each case, there is a means or an instrument, and in Gupapuyŋu, this is marked with the suffix, exactly as you would expect.<br/><br/><span style='font-size: 17px; color: #ffff00'>1. Noun ends in a vowel or glottal vowel (a, i, u or a’, i’, u’) → add –y</span><br/>Ŋarra ŋanya bumara dharpay → I hit him with a stick<br/>Ḻukuy nhe yurru marrtji → You’ll go by/on foot<br/><br/><span style='font-size: 17px; color: #ffff00'>2. Noun ends in a liquid consonant  or liquid and glotal stop (l, ḻ, r, rr, y, w, l', ḻ', r', rr', y', w') → add –yu</span><br/>Nhe ŋanya bumara ḏalkuyu → I hit him with an axe<br/>Nhe ŋanya bumara maŋal’yu → I hit him with a spear thrower<br/><br/><span style='font-size: 17px; color: #ffff00'>3. Noun ends in a nasal (m, n, ṉ, ny, ŋ) → add –dhu</span><br/>Ŋayi ŋanya bumara goŋdhu → She hit him with/by the/her hand<br/>Mitjiyaŋdhu ŋarra yurru marrtji → I’ll go by boat<br/><br/><span style='font-size: 17px; color: #ffff00'>4. Noun ends in a stop consonant or nasal + glottal (p, t, ṯ, tj, k, m’, n’, ny’, ṉ’, ŋ’) → add –thu</span><br/>Yarraman’thu ŋarra yurru marrtji → I’ll go by horseback<br/><br/>And there is also another interesting use for this suffix, one that lets us add it to verbs, not just nouns, to express the way in which something was done or achieved. In this case, we take the quaternary form of the verb and add -y. (Note: it’s always just -y, because all quaternary forms of verbs end in the vowel -a).<br/><br/>You can think of this as similar to using ‘by verbing’ in English.<br/><br/>Yothunha ŋayi mukmaraŋala waŋanharay → She quietened the baby by talking<br/>Yothunha ŋayi mukmaraŋala ŋaminiy gurrupanaray → She quietened the baby by giving it milk<br/><br/>Notice in the second example, ŋaminiy → milk also takes the suffix because it is part of the means by which the result was achieved."
  },
  {
    "locale": "عربي",
    "texto": ""
  },
  {
    "locale": "עברית",
    "texto": ""
  },
  {
    "locale": "فارسی",
    "texto": ""
  },
  {
    "locale": "יידיש",
    "texto": ""
  },
  {
    "locale": "português",
    "texto": ""
  },
  {
    "locale": "français",
    "texto": ""
  },
  {
    "locale": "türkiye",
    "texto": ""
  },
  {
    "locale": "日本語",
    "texto": ""
  },
  {
    "locale": "magyar",
    "texto": ""
  },
  {
    "locale": "українська",
    "texto": ""
  },
  {
    "locale": "gàidhlig (albannach)",
    "texto": ""
  }
]
