[
  {
    "locale": "español",
    "texto": ""
  },
  {
    "locale": "english",
    "texto": "Today we store memory in books, in databases, hard drives, mp3 files. But what about a people who store memory in the land itself?<br/><br/>Pause here and really think about that.<br/><br/>Imagine that every time you enter a new place, walk a track, pass through a wäŋa, the language itself shifts. New songs emerge. New dances. New relationships. Place doesn’t just have meaning, it holds memory. To retrieve it, you walk. You arrive. And it’s there, encoded in the land.<br/><br/>Think about that again, when you walk a dreaming track and arrive at a new territory you change your language, you create a new one, so that this new place holds new memory.<br/><br/>But then… what if someone tried to wipe that out? Tore you from the land. Stripped tens of thousands of years of memory, living, breathing, direct memory. How do you survive that?<br/><br/>This is why direction in First Nations languages carries a weight that English can’t reach. Because where you go isn’t just geography, it’s data retrieval.<br/><br/><span style='font-size: 17px; color: #ffff00'>The Dreaming holds the archive.</span><br/><br/>So as we step into these next suffixes, which deal with where actions happen and who they happen near, hold that in mind: This isn’t about prepositions. This is about memory architecture. This is about survival. And recovery.<br/><br/><span style='font-size: 17px; color: #ffff00'>The suffix -ŋura: in / on / at / near / inside</span><br/>This suffix is used to describe where an action is taking place, in a stationary location. It means in, at, on, near, or inside, but it only applies to things, not people.<br/><br/>Walala ga buḻ'yun wäŋaŋura → They are playing at camp / in the camp<br/>Ŋarra ga marrtji dhukarrŋura → I am walking on the road/path<br/>Nhe ga wukirri schoolŋura → You are writing at school<br/>Ŋarra ga buḻ'yun djinaga bala'ŋura → I’m playing inside the hut (“djinaga” means “inside”, and the noun following it, bala, must carry ŋura to anchor it: inside the hut)<br/>Walala ga buḻ'yun galki gurtha'ŋura → They’re playing near the fire (This suffix gives clarity and precision about the exact location. You can’t just say “near the fire” and leave it floating, you have to lock it in with ŋura).<br/><br/>What about “being” somewhere? Remember, there’s no verb “to be” in Gupapuyŋu. So, instead, we use posture verbs that express how something exists in space:<br/>nhina → to sit<br/>dhärra → to stand<br/>ŋorra → to lie<br/>gorruma → to be up/on top of<br/><br/>You pick the verb based on how the subject exists in place: Wandjuk wäŋaŋura ga nhina → He is in the camp (sitting)<br/>Raki' guṉḏaŋura ga ŋorra → The string is lying on the rock<br/>Djambaka tableŋura ga dhärra → The tin stands on the table<br/>Mitjiyan dhärra ga gapuŋura → The boat is on the water<br/>Yothu dharpaŋura ga gorruma → The child is up in the tree<br/><br/>Note that boats/canoes/things on water are considered “standing” on water, not sitting or floating. Also note: you don’t add ŋura to official place names:<br/>New York ŋayi ga nhina → He is in New York<br/>Lennox Head ŋarra ga nhina → I am at Lennox Head<br/><br/>We can also use -ŋura in a more abstract way, not just for physical locations, but to create adverbial expressions when connected with the quaternary form of a verb. In this case, we’re no longer talking about a physical noun like camp, tree, or rock, we’re anchoring the action itself as a kind of place, or state, where something is happening.<br/><br/>Think of it like saying:<br/>at work → meaning at the place of working<br/>at school → meaning at the place of writing / learning<br/>at washing → meaning at the place of washing<br/><br/>djämaŋura → at work (at the place of working)<br/>wukirriŋura → at school (at the place of writing/learning)<br/>ḻupthunaŋura → at washing (at the place of washing)<br/><br/>This is a very natural and useful way to answer questions like:<br/>Wanha nhe? → Where are you?<br/>Nhe djämaŋura → I’m at work.<br/><br/>What about when you are “with” someone?<br/>When the location relates to a person, we don’t use ŋura. Instead, we use the suffixes –wala, –gala, –kala, depending on the ending sound of the word. These mean with, by, or near a person.<br/><br/><span style='font-size: 17px; color: #ffff00'>1. Person ends in a vowel or vowel + glottal (a, i, u or a’, i’, u’) → –wala</span><br/>Ŋayi ga nhina Lorruwala → He is sitting with Lorru<br/>Ŋarra ga nhina yothuwala → I’m sitting with the baby<br/><br/><span style='font-size: 17px; color: #ffff00'>2. Person ends in a nasal (m, n, ṉ, ny, ŋ) → –gala</span><br/>Walala Raymangala ga djäma → They are working with Rayman<br/>Nhe Djimbuṉgala ga marrtji → You’re going with Djimbuṉ<br/><br/><span style='font-size: 17px; color: #ffff00'>3. Person ends in a stop consonant or nasal + glottal (p, t, ṯ, tj, k, m', n', ny', ṉ', ŋ') → –kala</span><br/>Miyalkkala ŋayi ga nhina → He is with the woman<br/>Yawirriny'kala nhe ga nhina → You are with the single boys<br/><br/><span style='font-size: 17px; color: #ffff00'>4. Person ends in a liquid or glide (l, ḻ, r, rr, y, w) → –gala or –wala</span><br/>Ŋarra dhu nhina Garmburrgala → I will sit with Garmburr<br/><br/><span style='font-size: 17px; color: #ffff00'>5. Person ends in a liquid/glide + glottal (l’, ḻ’, r’, rr’, y’, w’) → –kala or –wala</span><br/>Ŋarra dhu nhina Mäw'kala → I will sit near Mäw’<br/><br/>The personal pronouns take these suffixes too:<br/><br/><span style='font-size: 17px; color: #ffff00'>Singular, One person:</span><br/>Ŋarrakala → me<br/>Nhokala → you<br/>Nhanukala → him / her<br/><br/><span style='font-size: 17px; color: #ffff00'>Dual, Two people:</span><br/>Ŋalitjalaŋgala → us (you and I)<br/>Ŋalinyalaŋgala → us (he/she and I)<br/>Nhumalaŋgala → you two<br/>Maṉdaŋgala → them two<br/><br/><span style='font-size: 17px; color: #ffff00'>Plural, Three or more:</span><br/>Ŋalimurruŋgala → us (you and I)<br/>Ŋanapurruŋgala → us (them and I)<br/>Nhumalaŋgala → you all<br/>Walalaŋgala → them<br/><br/>And this also works for commands!<br/>- Nhini galki ŋarrakala → Sit with me!<br/>- Nhini galki yapawala → Sit near sister!<br/><br/>And we can also use these suffixes to denote by/with whom an action takes place, when that instrument is a human, just like we saw for things in Lesson 11.<br/><br/>This is especially useful when someone is acting through or with the help of another person, or sending something via someone, again carrying that same deeper logic of purpose and relational flow.<br/><br/>Ŋarra nhaŋu djorra’ djuy’yurruna Lorruwala → I sent him a letter by/with Lorru<br/>Nhe nhaŋu djorra’ djuy’yurruna ŋarrakala → You sent him a letter by/with me<br/>Girri’ walala Bäpawa djuy’yurruna ŋalinyalaŋgala → They sent father a letter by/with us<br/><br/>These suffixes don’t just locate you in space or in action, they locate you in memory. Because place and action isn’t background, it’s archive. It’s witness. It holds songs, names, ceremonies, laws. It remembers what people forget.<br/><br/>So don’t rush them. Don’t reduce them to grammar drills. Think about the structures that need to be built to ensure that memory can't be stripped again. Structures that are strong enough to carry law, story, and presence, even through silence, even through loss."
  },
  {
    "locale": "عربي",
    "texto": ""
  },
  {
    "locale": "עברית",
    "texto": ""
  },
  {
    "locale": "فارسی",
    "texto": ""
  },
  {
    "locale": "יידיש",
    "texto": ""
  },
  {
    "locale": "português",
    "texto": ""
  },
  {
    "locale": "français",
    "texto": ""
  },
  {
    "locale": "türkiye",
    "texto": ""
  },
  {
    "locale": "日本語",
    "texto": ""
  },
  {
    "locale": "magyar",
    "texto": ""
  },
  {
    "locale": "українська",
    "texto": ""
  },
  {
    "locale": "gàidhlig (albannach)",
    "texto": ""
  }
]
