[
  {
    "locale": "español",
    "texto": ""
  },
  {
    "locale": "english",
    "texto": "We’ll get back to grammar in the next lesson. But for now, let’s sit inside something powerful, something most language learners skip right over: how meaning is built. And to really feel this, let’s borrow a lens from Japanese. Don’t worry if you haven’t studied it. Most people haven’t. But here’s the thing — understanding a little about how Japanese works will help you grasp something deeply intuitive about Gupapuyŋu (and then when you might eventually learn Japonese, you'll already be highly attuned).<br/><br/>In Japanese, you write using a set of picture-like symbols called kanji. They’re not random — each one is made of smaller parts that tell a story. Take this kanji: 本 — pronounced hon, meaning book.<br/><br/>But it’s not just a symbol for “book”. Look closer. The bottom part is 木 (ki), which means tree. And the line across the base? That marks the root, the source. So, a book isn’t just a “book” — it’s the source from the tree (wood). A vessel of origin. You read the word hon, but you also feel what it’s made of. It’s etymology you can see.<br/><br/>Here’s another one: 積読 — tsundoku. It combines: 積 = to pile up, accumulate and 読 = to read. So what does tsundoku mean? It means: the act of buying books and letting them pile up unread! There’s no single English word for that feeling — but Japanese builds one, out of imagery and action. And when you see it, you get it. Viscerally.<br/><br/>That’s the magic of compound meaning: the parts tell a story, and the story unlocks a whole world. Now — why are we talking about Japanese? Because Gupapuyŋu does this too. It doesn’t use visual symbols. It’s oral. But it builds compound words in the exact same way: combining smaller, meaningful units — pieces of sound and image — into bigger, richer ideas.<br/><br/.Let’s try one:<br/>dhä = mouth<br/>birrka’yun = try<br/><br/>Put them together:<br/>dhä-birrka’yun → “to try with the mouth” → to question<br/><br/>It makes sense, doesn’t it? A question is a trial, voiced out loud. You’re not sure, but you send your mouth forward anyway. A verbal reach. It’s not just poetic — it’s functional, logical, embodied. That’s how meaning works here!<br/><br/>More examples:<br/>ḻiya-ḏäl → head + strong = clever<br/>ḻiya-dhumuk → head + blunt = dull, lawless<br/>mel-gurrupan → eye + give = to show<br/>gupa-waŋa → back of neck + talk = talk behind someone’s back (gossip)<br/><br/>These words are little machines of meaning. You don’t just memorize them — you build them, feel them, watch them emerge from their parts. And some are unexpected — like in Japanese.<br/><br/>In Japanese, many kanji come from ancient village life: rice paddies, moon cycles, temples, tools. So some meanings aren’t immediately obvious unless you step into that worldview. Gupapuyŋu is similar. Some compounds are transparent. Others pull from landscapes, social structures, or tools that no longer exist in your life — but which were central to Yolŋu survival. Which makes them even more powerful.<br/><br/>Try these:<br/>makarr-yindi → thigh + big = mainland<br/>dhakal-gurriri → cheek/fruit + short = round island<br/>ḻiya-yindi → head + big = dwarfed, undersized<br/><br/>They might feel strange at first — but they’re accurate. Visually, spatially. Because language here isn’t just a tool for pointing at things. It’s a reflection of stories and memory.<br/><br/>Come across more of these compound words in the dictionary <a style='cursor: url('https://thedial.infura-ipfs.io/ipfs/QmbR22PYokrESYeCtwrwpETsby8q959zVNJgSv1x136yiQ'), auto;' href='https://dhawu.emancipa.xyz/marnggithinyawuy/'>here</a>."
  },
  {
    "locale": "عربي",
    "texto": ""
  },
  {
    "locale": "עברית",
    "texto": ""
  },
  {
    "locale": "فارسی",
    "texto": ""
  },
  {
    "locale": "יידיש",
    "texto": ""
  },
  {
    "locale": "português",
    "texto": ""
  },
  {
    "locale": "français",
    "texto": ""
  },
  {
    "locale": "türkiye",
    "texto": ""
  },
  {
    "locale": "日本語",
    "texto": ""
  },
  {
    "locale": "magyar",
    "texto": ""
  },
  {
    "locale": "українська",
    "texto": ""
  },
  {
    "locale": "gàidhlig (albannach)",
    "texto": ""
  }
]
