[
  {
    "locale": "español",
    "texto": ""
  },
  {
    "locale": "english",
    "texto": "How are you going with all the suffixes? We’re now at Lesson 18 — you’ve come a long way. And here’s the good news: there actually aren’t that many more brand-new concepts to cover. You’ve already built the core structure. From here on, it’s about adding nuance, refining expression, and deepening your feel for the language.<br/><br/>In this lesson, we’ll meet a new suffix — one we haven’t explored yet.<br/><br/>But first, if this is your first language to learn deeply, or your first suffix-heavy language, trust me: you are building skills that will serve you for life.<br/><br/>You will feel it, one day, when you approach languages like Turkish, Ukrainian, Japanese, or Hungarian — languages where suffix logic is central. You’ll already have the muscle memory for it.<br/><br/>And more importantly: you are helping correct a deep imbalance. Too often, native languages are seen as curiosities — not as languages worthy of the same intellectual respect as European or classical languages.<br/><br/>But they are.<br/>Languages like Gupapuyŋu are systems of thought, archives of memory, technologies of survival — just as rigorous, just as beautiful, just as intricate.<br/><br/>And when you study them seriously, you carry them forward — you help ensure that their complexity and depth are not lost to time or to neglect.<br/><br/>It is never a waste to learn a native language.<br/>On the contrary — they open you, and sharpen you.<br/><br/>I know that every time I hear and speak (still learning) Scottish Gaelic, there is a fire lit in my blood. I could cry. Not because of nostalgia — but because of the deep, electric recognition of a language that resisted, that remembers a different way of seeing the world. And it’s the same feeling I now sense growing as I learn Gupapuyŋu — a pulse of memory that speaks across time and land.<br/><br/>Oh — and if you haven’t yet, you can also check out a small side project of mine: my little Highlander x Yolŋu futurism vision. It’s just one thread of a future I’m weaving for myself — blending two cultures that hold deep resonance for me: the world of the Scottish Celts and that of the Yolŋu.<br/><br/>Have a peek if you like <a href='https://highlangu.emancipa.xyz/'>here</a> — it’s a playful window into where my mind already lives, and what kind of futures I'm working to build.<br/><br/>Now — to the new suffix:<br/>-buy / -puy / -wuy<br/><br/>We can add this suffix to a noun (but not a person) to express another kind of possession — and it’s a little more specific than simple have, like we saw with -mirri. Here, this suffix means something closer to:<br/>belonging to / about / for.<br/><br/><span style='font-size: 17px; color: #ffff00'>1. If the noun ends in a nasal (m, n, ṉ, ny, ŋ) → -buy</span><br/>Dhuwala mitjiyaŋbuy djämamirri → This is a boat worker / crew boy<br/>Dhuwala guḻunbuy bä’pali → This is stomach medicine / medicine for the stomach<br/><br/><span style='font-size: 17px; color: #ffff00'>2. If the noun ends in a stop (p, t, ṯ, tj, k, ’) → -puy</span><br/>Dhuwala Galiwin’kupuy yolŋu → This is an Elcho Aborigine<br/><br/><span style='font-size: 17px; color: #ffff00'>3. If the noun ends in a vowel, vowel + glottal, or a liquid or liquid + glottal (a, i, u, a’, i’, u’, l, ḻ, r, rr, y, w, l’, ḻ’, r’, rr’, y’, w’) → -puy or -wuy</span><br/>Dhuwala gapupuy balanda → This is a seaman (non-Aboriginal man belonging to/from the sea)<br/>Dhuwala mulmupuy bathi → This is a box for hay<br/>Ŋarra dhäwu ḻakaraŋala guyapuy → I told a story about a fish<br/><br/>If we add an adjective, it must also carry the suffix — just like we saw with all other suffixes:<br/>Dhuwala gapupuy raypinybuy guya → This is a freshwater fish<br/>Ŋayi dhäwu ḻakaraŋala guyapuy märrma’wuy → He told a story about two fish<br/><br/>You can also add this suffix to the quaternary form of a verb — and now it takes on the meaning of 'about' or 'for'.<br/><br/>This is incredibly useful for building sentences like:<br/>Dhäwu ŋayi ḻakaraŋala miyapunuwuy dharpunhawuy → He told a story about spearing a turtle<br/>Dhäwu ŋayi ḻakaraŋala bäpipuy bunhawuy → He told a story about killing a snake<br/><br/>Or, responding to questions like:<br/>Nhäpuy dhuwali? → What’s this for / about?<br/>Dhawaraŋbuy belanhawuy → For digging holes<br/>Guyapuy ŋorranhawuy → For fish to lie in<br/><br/>Wanhaŋuwuy dhuwala yolŋu? → Where does this person belong?<br/>Yirrkalawuy → To Yirrkala<br/><br/>If we want to express belonging to / about / for with humans, we switch to a familiar structure: -galaŋuwuy / -kalaŋuwuy / -walaŋuwuy<br/>These follow the exact same rules we learned back in Lesson 13, except here we replace ŋuru with wuy.<br/><br/><span style='font-size: 17px; color: #ffff00'>1. Person ends in a vowel or vowel + glottal → -walaŋuwuy</span><br/>Ŋarra yurru yothuwalaŋuwuy dhäwu ḻakarama → I’ll tell a story about a child<br/><br/><span style='font-size: 17px; color: #ffff00'>2. Person ends in a nasal → -galaŋuwuy</span><br/>Ŋarra yurru Stephengalaŋuwuy dhäwu ḻakarama → I’ll tell a story about Stephen<br/><br/><span style='font-size: 17px; color: #ffff00'>3. Person ends in a stop consonant or nasal + glottal → -kalaŋuwuy</span><br/>Ŋarra yurru miyalkkalaŋuwuy dhäwu ḻakarama → I’ll tell a story about a woman<br/><br/><span style='font-size: 17px; color: #ffff00'>4. Person ends in a liquid or glide → -galaŋuwuy or -walaŋuwuy</span><br/>Ŋarra yurru Mawuyulgalaŋuwuy dhäwu ḻakarama → I’ll tell a story about Mawuyul<br/><br/><span style='font-size: 17px; color: #ffff00'>5. Person ends in a liquid/glide + glottal → -kalaŋuwuy or -walaŋuwuy</span><br/>Ŋarra yurru Mäw’galaŋuwuy dhäwu ḻakarama → I’ll tell a story about Mäw’<br/><br/>The personal pronouns take this suffix too:<br/><span style='font-size: 17px; color: #ffff00'>Singular — One person:</span><br/>Ŋarrakalanŋuwuy → me<br/>Nhokalanŋuwuy → you<br/>Nhanukalanŋuwuy → him/her<br/><br/><span style='font-size: 17px; color: #ffff00'>Dual — Two people:</span><br/>Ŋalitjalaŋgalanŋuwuy → us (you and I)<br/>Ŋalinyalaŋgalanŋuwuy → us (he/she and I)<br/>Nhumalaŋgalanŋuwuy → you two<br/>Maṉdaŋgalanŋuwuy → them two<br/><br/><span style='font-size: 17px; color: #ffff00'>Plural — Three or more:</span><br/>Ŋalimurruŋgalanŋuwuy → us (you and I)<br/>Ŋanapurruŋgalanŋuwuy → us (them and I)<br/>Nhumalaŋgalanŋuwuy → you all<br/>Walalaŋgalanŋuwuy → them<br/><br/>You might sometimes hear it pronounced as walaŋa instead of walaŋu — but it means the same thing!"
  },
  {
    "locale": "عربي",
    "texto": ""
  },
  {
    "locale": "עברית",
    "texto": ""
  },
  {
    "locale": "فارسی",
    "texto": ""
  },
  {
    "locale": "יידיש",
    "texto": ""
  },
  {
    "locale": "português",
    "texto": ""
  },
  {
    "locale": "français",
    "texto": ""
  },
  {
    "locale": "türkiye",
    "texto": ""
  },
  {
    "locale": "日本語",
    "texto": ""
  },
  {
    "locale": "magyar",
    "texto": ""
  },
  {
    "locale": "українська",
    "texto": ""
  },
  {
    "locale": "gàidhlig (albannach)",
    "texto": ""
  }
]
