[
  {
    "locale": "español",
    "texto": ""
  },
  {
    "locale": "english",
    "texto": "Continuing from possession, let’s talk about another way to express ownership, using a verb. In English, we use the verb “to have”, we’d say “I have a house.” It’s a different structure, but it communicates something similar to “That is my house.”<br/><br/>But in Gupapuyŋu, there is no exact equivalent to the verb “to have”. Possession works differently.<br/><br/>And that’s not strange at all. If you’ve studied Hungarian, Scottish Gaelic, Ukrainian, Japanese… you’ll already know this: “to have” is a strange verb. It’s irregular, slippery, and often behaves differently from other verbs.<br/><br/>And why is that?<br/><br/>Because it’s charged. Saying “I have” isn’t neutral. It’s a declaration. A line drawn. It says something about you and what you claim. It’s no wonder that so many languages have evolved other ways to express this, more indirect, more relational.<br/><br/>In Gupapuyŋu, we use a suffix, …and here’s your first real taste of how suffix-heavy this language is. If you’ve learned Hungarian, Turkish, Japanese, Arabic, Farsi or Hebrew, you’re going to feel right at home. If not… welcome to a whole new way of thinking. Master this, and you’re unlocking an entire family of languages!<br/><br/>To express possession, we add the suffix –mirri to the noun, it’s like saying “with”, “possessing”, or “has”.<br/><br/><span style='font-size: 17px; color: #ffff00'>Examples with mirri (to have / possessing):</span><br/>- Dhuwala yolŋu rrupiyamirri → This man has money<br/>- Dhuwala miyalk yothumirri → This woman is pregnant / has a child<br/>- Dhuwala miyalk djamarrkuḻi'mirri → This woman has children<br/>- Dhuwala djambaka ŋathamirri → This can has food inside it<br/>- Dhuwala djambaka djetjimirri → This can has holes<br/>- Dhuwala yolŋu wäŋamirri → This man is married (has a home)<br/>- Dhuwala yolŋu miyalkmirri → This man has a wife<br/>- Dhuwala yolŋu djämamirri → This man has work<br/>- Dhuwala yolŋu rerrimirri → This man is sick (has sickness)<br/>- Dhuwala yolŋu garamirri → This man has spears<br/>- Dhuwala djorra' manikaymirri → This book contains songs<br/>- Dhuwala djorra' dhäwumirri → This book has stories<br/>- Dhuwala wäŋa marimirri → This place has trouble / is bad<br/>- Dhuwala wäŋa dhukunmirri → This place is full of rubbish<br/><br/>And “not having”? Just one sound shifts: –mirri becomes –miriw, which means without / does not have.<br/><br/><span style='font-size: 17px; color: #ffff00'>Examples with miriw (without / does not have):</span><br/>- Dhuwala yolŋu miyalkmiriw → This man is not married<br/>- Dhuwala yolŋu rrupiyamiriw → This man has no money<br/>- Dhuwala yothu ŋäṉḏimiriw → This child has no mother<br/>- Dhuwala yothu bäpämiriw → This child has no father<br/>- Dhuwala galku gapumiriw → This coconut has no juice<br/>- Dhuwala galku ŋathamiriw → This coconut has no flesh / food<br/><br/><br/>In English, to have is mostly about ownership. But in Gupapuyŋu, the suffixes –mirri (with) and –miriw (without) do something richer. They don't just mark possession, they shape being.<br/><br/>This isn't about owning a car or a house. It's about expressing that someone is with child, that a place is with rubbish, that a person is with sickness, that a coconut is without flesh. The scope is broader, and more intimate.<br/><br/>These aren’t metaphors. The language frames the world this way by default. What’s present, what’s absent, what clings to the body, what defines a relationship, what lingers in a space. Mirri and miriw don't describe ownership. They describe entanglement.<br/><br/>So what does this tell us about the culture?<br/>In Gupapuyŋu, possession is not control.<br/>It’s not about what you dominate or what you own in a legal sense. It’s about what is part of you, what surrounds you, what marks your condition. To be “with something”, a home, a spear, a wife, a story, is not a declaration of authority. It’s a statement of context, of connection, of co-existence.<br/><br/>To be “without something” is not always a lack. Sometimes it's simply a state, not yet, no longer, or outside. This reflects a cultural logic where relations matter more than possessions. Where land is not owned but belonged to, where family is not just “had” but lived through, and where being “with” or “without” shapes identity far more deeply than a legal document on its own ever could.<br/><br/><span style='font-size: 17px; color: #ffff00'>Language is worldview.</span><br/>If I've learnt anything in my own rigorous study and scholarly pursuit (so far) in languages. It's that learning words is not learning a language.<br/><br/>To really learn Gupapuyŋu, not just memorize it, but feel it, you have to think in it. You have to understand what matters: kinship, land, connection, presence. Otherwise, you’ll keep translating from English, and you’ll miss everything that makes this language alive.<br/><br/>This isn’t grammar for grammar’s sake.<br/>It’s grammar that carries law.<br/>It carries kin.<br/>It carries place.<br/><br/>Mirri means with.<br/>Miriw means without.<br/>But neither is neutral. Both are soaked in meaning.<br/><br/>And maybe that’s the point:<br/>Fluency is not just saying the words.<br/>It’s seeing the world the way the words already do."
  },
  {
    "locale": "عربي",
    "texto": ""
  },
  {
    "locale": "עברית",
    "texto": ""
  },
  {
    "locale": "فارسی",
    "texto": ""
  },
  {
    "locale": "יידיש",
    "texto": ""
  },
  {
    "locale": "português",
    "texto": ""
  },
  {
    "locale": "français",
    "texto": ""
  },
  {
    "locale": "türkiye",
    "texto": ""
  },
  {
    "locale": "日本語",
    "texto": ""
  },
  {
    "locale": "magyar",
    "texto": ""
  },
  {
    "locale": "українська",
    "texto": ""
  },
  {
    "locale": "gàidhlig (albannach)",
    "texto": ""
  }
]
