[
  {
    "locale": "español",
    "texto": ""
  },
  {
    "locale": "english",
    "texto": "Time to move. Let’s start forming sentences with verbs.<br/><br/>Gupapuyŋu expresses action in a way that will feel very familiar if you’re a native English speaker. Think about how we talk in the present tense: I’m working. I’m swimming. I’m watching. We don’t usually say “I work” or “I swim” to talk about what’s happening right now. We use the continuous present, marked by “am + verb-ing.”<br/><br/>And Gupapuyŋu does exactly the same thing — but in its own beautifully efficient way.<br/><br/>The structure is simple: You use the primary form of the verb + the particle ga.<br/><br/>Every verb in Gupapuyŋu has around four forms, and there are nine verb groups. Each group follows similar patterns — but honestly, that can wait. Don’t stress about the verb forms. The more you listen, read, and speak, the more naturally the patterns will click into place. You can always check the dictionary <a style='cursor: url('https://thedial.infura-ipfs.io/ipfs/QmbR22PYokrESYeCtwrwpETsby8q959zVNJgSv1x136yiQ'), auto;' href='https://dhawu.emancipa.xyz/wukirri/djama/'>here</a> to see verb forms in full. Some verbs don’t even change between forms — especially in Group 1. So for now, just watch how it’s used.<br/><br/>Oh — and just in case you're also wondering: Why do verbs even need to be grouped in the first place?<br/><br/>Well, here's another beautiful twist. Hebrew also organises its verbs into groups. Seven main ones today. And in ancient forms? There were nine. Just like in Gupapuyŋu! Isn't that wild? Across time and continents, completely different cultures converging on the same solution.<br/><br/>This “ga” works kind of like the English am/is/are + ing — it shows that something is happening now.<br/><br/>ga djäma → working<br/>ga wukirri → writing<br/>ga waŋa → talking<br/><br/>And then, just add the subject:<br/><br/>ŋayi ga djäma → she/he is working<br/>maṉḏa ga wukirri → those two are writing<br/>ŋarra ga waŋa → I am speaking<br/><br/>And, remember, word order is flexible! One of the powerful features of Gupapuyŋu is that you can shift the word order depending on what you want to emphasise.<br/>ŋorra ga ŋarra → I am lying down (emphasis on the action)<br/>nhäma ga nhe → you are looking / seeing<br/>waṉḏirri ga walala → they are running<br/><br/>This flexibility is not random — it’s intentional, musical, and context-sensitive. You put what matters first. It's storytelling logic, not mechanical grammar.<br/><br/>And if we want to express the negative form? Like, “I'm not working”, “I'm not lying down”. There's a slight change.<br/><br/>First, we add the work “yaka”. ✳️ Yaka = no / not / don’t.<br/>Second, we change “ga” to “gi”.<br/>Third, we use the secondary form of the verb.<br/>Let's see some examples:<br/>Walala gi yaka buḻ'yurru → They are not playing<br/>ŋayi gi yaka djäma → She is not working<br/><br/>We can also use “bäyŋu” instead of “yaka”. And it means the same thing. ✳️ Bäyŋu = none / nothing / negative.<br/><br/>Walala gi bäyŋu buḻ'yurru → They are not playing<br/>ŋayi gi bäyŋu djäma → She is not working"
  },
  {
    "locale": "عربي",
    "texto": ""
  },
  {
    "locale": "עברית",
    "texto": ""
  },
  {
    "locale": "فارسی",
    "texto": ""
  },
  {
    "locale": "יידיש",
    "texto": ""
  },
  {
    "locale": "português",
    "texto": ""
  },
  {
    "locale": "français",
    "texto": ""
  },
  {
    "locale": "türkiye",
    "texto": ""
  },
  {
    "locale": "日本語",
    "texto": ""
  },
  {
    "locale": "magyar",
    "texto": ""
  },
  {
    "locale": "українська",
    "texto": ""
  },
  {
    "locale": "gàidhlig (albannach)",
    "texto": ""
  }
]
