[
  {
    "locale": "español",
    "texto": ""
  },
  {
    "locale": "english",
    "texto": "Cool, we're now at Lesson 8! We’ve made it far, through pronouns, possession, commands, action. Now it’s time to turn to… well, time itself.<br/><br/>We’ve touched the present tense, the immediacy of now. But what about the past? And what about the future?<br/><br/>Here’s the thing: time in Gupapuyŋu doesn’t work the way English imagines it.<br/><br/>In English, time is treated like a straight line. Something happens, then it’s over. One direction. One speed. A clock. A timeline. Fixed. Objective.<br/><br/>But physics has already dismantled that idea: time is a variable. It bends. It’s relative. We just happen to experience it as linear, for now.<br/><br/>But in Gupapuyŋu, this flexibility isn’t theoretical, it’s linguistic. The past isn’t just “the past.” The future isn’t just “the future.” There are layers. Distances. Textures of time.<br/><br/>What happened today is marked differently from what happened yesterday. What happened once is different from what happened many times over time. And what's about to today is different than what might happen tomorrow.<br/><br/>So as we move into past and future forms, keep this in mind: You’re not just learning how to “conjugate”. You’re learning a new way to mark memory. And memory is everything. It’s how we track responsibility, how we hold stories, how we know who we are and where we’ve been. When your language encodes memory through time, not just when something happened, but how it echoes, then remembering becomes active, layered, communal.<br/><br/>And when memory is wiped out, through force, through silence, through erasure, the time in a language collapses.<br/><br/>So learning this isn’t just about verbs. It’s about recovering how a people remember, and refusing to forget.<br/><br/><span style='font-size: 17px; color: #ffff00'>Same Day Past:</span><br/>This is used for any event that happened Today. Sometimes it can also be used to express something that happened in the indefinite past. Not time or fixed date is given, and it might have happened a long time ago. Here, we use the tertiary form of the verb.<br/>Ŋarra marrtjina -> I went<br/>Nhe ŋäthina -> You cried<br/>Ŋayi wothina -> She disappeared<br/>Ŋayi giritjina -> He danced<br/><br/><span style='font-size: 17px; color: #ffff00'>Yesterday Past:</span><br/>This is used for any event that happened Yesterday or in the recent past (but not today!) and especially we use this form when a definite time is given (Like last week, or on this day). Here, we use the primary form of the verb.<br/>Ŋarra djäma barpuru-> I worked yesterday<br/>Nhe nhäma barpuru-> You saw yesterday<br/>Barpuru ŋayi marrtji -> Yesterday she went<br/><br/><span style='font-size: 17px; color: #ffff00'>Yesterday Continuous Past:</span><br/>This past forms follows the same rules as the Yesterday past, we use it for any action that happened yesterday or at a specific named point in the past. However, now we are expressing something that happened over a period of time. For example, it's like saying “I was working”, rather than just “I worked”. We use the primary form and add ga.<br/>Barpuru ŋarra ga djäma -> Yesterday I was working<br/>Barpuru ŋarra ga giritjirri -> Yesterday I was dancing<br/><br/><span style='font-size: 17px; color: #ffff00'>Same Day Continuous Past:</span><br/>And to express continuity for something that happened today or when a specific time is not inferred we use gana + the tertiary form of the verb.<br/>Nhe gana ŋäthina -> He was crying<br/>Ŋarra gana ŋorrana -> I was lying down<br/>Walala gana nhäŋala -> They were looking<br/><br/><span style='font-size: 17px; color: #ffff00'>Yesterday Past Negative:</span><br/>To express that something didn't happen in the yesterday past we change the verb to its seconday form and add yaka.<br/>Ŋarra yaka nhäŋu barpuru -> I didn't see it yesterday<br/>Maṉḏa barpuru yaka ḻuki -> Those two didn't eat yesterday<br/><br/><span style='font-size: 17px; color: #ffff00'>Yesterday Continuous Past Negative:</span><br/>For the continuous yesterday past, we use the secondary form, add yaka and change ga to gi.<br/>Yaka ŋarra gi djäma -> I wasn't working<br/>Ŋarra yaka gi ŋorri -> I wasn't sleeping yesterday<br/><br/>You might have noticed that the yesterday continuous past negative is the same as the present continuous negative, so usually we add an adverb of time like barpuru to make it clear that it was something in the past that didn't happen.<br/><br/><span style='font-size: 17px; color: #ffff00'>Same Day Past Negative:</span><br/>Here we use the quaternary form of the verb and add either yaka or bäyŋu.<br/>Ŋarra bäyŋu djäma -> I didn't work<br/> Nhe bäyŋu wukirri -> You didn't write<br/><br/><span style='font-size: 17px; color: #ffff00'>Same Day Continuous Past Negative:</span><br/>Here we also use the quaternary form of the verb and add gana and either yaka or bäyŋu.<br/>Ŋarra gana bäyŋu djäma -> I wasn't work<br/> Nhe gana bäyŋu wukirri -> You weren't writing"
  },
  {
    "locale": "عربي",
    "texto": ""
  },
  {
    "locale": "עברית",
    "texto": ""
  },
  {
    "locale": "فارسی",
    "texto": ""
  },
  {
    "locale": "יידיש",
    "texto": ""
  },
  {
    "locale": "português",
    "texto": ""
  },
  {
    "locale": "français",
    "texto": ""
  },
  {
    "locale": "türkiye",
    "texto": ""
  },
  {
    "locale": "日本語",
    "texto": ""
  },
  {
    "locale": "magyar",
    "texto": ""
  },
  {
    "locale": "українська",
    "texto": ""
  },
  {
    "locale": "gàidhlig (albannach)",
    "texto": ""
  }
]
