[
  {
    "locale": "español",
    "texto": ""
  },
  {
    "locale": "english",
    "texto": "Present. Past. Now, the future.<br/><br/>Similar to the past, we also use different forms of the future depending on when it's going to happen.<br/><br/><span style='font-size: 17px; color: #ffff00'>Tomorrow Future:</span><br/>This uses the secondary form of the verb with the particle dhu. And we use it for any event that will take place from tomorrow onwards when there is also a definite/specific time implied, like: next week, in one month, next year.<br/>Goḏarr' ŋarra dhu djäma -> Tomorrow I will work<br/>Nhe dhu bothuru goḏarr' -> You will count tomorrow<br/>Dhu gäŋu ŋarra goḏarr' -> I will bring it tomorrow<br/><br/><span style='font-size: 17px; color: #ffff00'>Tomorrow Future Negative:</span><br/>This is very simple. Everything stays the same, we just add yaka!<br/>Goḏarr' ŋarra yaka dhu djäma -> Tomorrow I will not work<br/>Nhe dhu bothuru yaka goḏarr' -> You will not count tomorrow<br/>Yaka dhu gäŋu ŋarra goḏarr' -> I will not bring it tomorrow<br/><br/><span style='font-size: 17px; color: #ffff00'>Same Day Future:</span><br/>We use this form for anything that will occur today or in the future with no definite/specified time. The primary form of the verb is used with dhu.<br/>-Yalala nhe dhu roŋiyirri -> Later on you will return<br/>- Maṉḏa dhu gungama yalala -> Those two will shut it later on<br/>-Ŋarra yalala dhu ŋäma -> I'll hear it later on<br/><br/><span style='font-size: 17px; color: #ffff00'>Same Day Future Negative:</span><br/>Very easy! Again, all the same, just add yaka.<br/>- Yaka nhe dhu roŋiyirri -> You won't return<br/>- Maṉḏa dhu gungama yaka -> Those two won't shut it<br/>-Ŋarra yaka dhu ŋäma -> I won't hear it<br/><br/>And after all that — maybe now you’re starting to feel it: This language doesn’t just mark what happened. It marks how time sits in the body.<br/><br/>There’s no one “past.” There’s today’s past, yesterday’s past, the past that stretches, the past that repeats, the past that’s still alive. The grammar doesn’t ask when. It asks what kind of memory is this?<br/><br/>And the future? It’s not a blank space waiting to be filled. It’s already forming, already named.<br/><br/> Gupapuyŋu doesn't treat time as something to manage.<br/>It treats it as something you carry.<br/><br/>Once you see that, you realise: You’re not learning tenses. You’re learning how to move inside time the way Yolŋu do."
  },
  {
    "locale": "عربي",
    "texto": ""
  },
  {
    "locale": "עברית",
    "texto": ""
  },
  {
    "locale": "فارسی",
    "texto": ""
  },
  {
    "locale": "יידיש",
    "texto": ""
  },
  {
    "locale": "português",
    "texto": ""
  },
  {
    "locale": "français",
    "texto": ""
  },
  {
    "locale": "türkiye",
    "texto": ""
  },
  {
    "locale": "日本語",
    "texto": ""
  },
  {
    "locale": "magyar",
    "texto": ""
  },
  {
    "locale": "українська",
    "texto": ""
  },
  {
    "locale": "gàidhlig (albannach)",
    "texto": ""
  }
]
